---
kind: type
id: T:Autodesk.Revit.DB.Analysis.gbXMLExportBuildingEnvelope
source: html/38b227f5-0d59-fef1-c617-a9ee57c80ff5.htm
---
# Autodesk.Revit.DB.Analysis.gbXMLExportBuildingEnvelope

Indicates the determination method for the building envelope

## Syntax (C#)
```csharp
public enum gbXMLExportBuildingEnvelope
```